11/data/attachments/20f7a1e25f5bc988.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_703cfd77-f093-441b-a192-5f4b67bb892e</nif:username>
            <nif:friendToBeAdded>Jacob_entire_Actions_22962_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>